# Итоговая контрольная работа по основному блоку.

#### Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:

```
1. Создать репозиторий на [Git Hub](https://github.com/).
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод).
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md).
4. Написать программу, решающую поставленную задачу.
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах).
```

*Задача*: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.


# Решение.

Для того что бы пользователь ввел свой массив с клавиатуры, создаем метод `string[] ArrayInput`, который принимает параметр колличество элементов массива `int count`. Заранее спрашиваем пользователя `Console.WriteLine("Введите количество элементов массива")` из скольки элементов массив будет состоять `int count = Convert.ToInt32(Console.ReadLine())`. В самом методе создаем пустой массив с колличеством элементов указаных пользователем и заполняем его через цикл `for`, проходя по каждому индексу массива, где просим пользователя ввести данные элементов массива `Console.WriteLine("Введите текст элемента")`. Метод возвращает массив строк который ввел пользователь.

Далее создаем метод `string[] NewArray (string[] arr)` который в качестве параметра принемает введеный массив от пользователя или уже готовый массив. В нем мы проходим по элементам с помощью цикла `for` и отсеиваем те в которых колличество символов меньше 3х, через условие `if`. Колличество прошедших элементов сохраняяем в новую переменную `count`. Далее создаем новый пустой массив с этим количеством элементов. Проходим циклом `for` по введенному массиву и те элементы которые меньше 3х через условие `if` записываются в новый массив. Метод возвращает новый массив с теми эленментами которые прошли заданное условие.

После этого создаем метод для вывода данных `void Print (string[] array)`. В качестве параметра принемает сформированный массив и каждый элемент этого массива выводиться строкой через запятую.

Далее вызываем методы в зависимости от вводных данных.

Пример.
```
string[] createdArray = {"1234", "1567", "-2", "computer science"}; 
Console.WriteLine("Введеный массив");
Print (createdArray);
Console.WriteLine("Новый массив");
Print(NewArray(createdArray)); 

```
Вывод в консоль:

Введеный массив
1234, 1567, -2, computer science
Новый массив
-2